---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.GetTypeList
source: html/b8638d82-adc0-b94c-eb05-e10634c5c27d.htm
---
# Autodesk.Revit.DB.IFC.IFCData.GetTypeList Method

Gets the multiple strings represent one IFC type name.

## Syntax (C#)
```csharp
public IList<string> GetTypeList()
```

## Returns
The strings.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - No type assigned or it is a simple type.